dontsovcmc/waterius/ESP8266/src/json.cpp

#include "json.h"
#include <ESP8266WiFi.h>
#include "Logging.h"
#include "utils.h"
#include "porting.h"
#include "voltage.h"
#include "sync_time.h"
#include "wifi_helpers.h"
#include "core/alarm.h"
#include "core/idle.h"

extern Voltage voltage;

void get_json_data(const Settings &sett, const AttinyData &data, const CalculatedData &cdata, JsonDocument &json_data)
{
    JsonObject root = json_data.to<JsonObject>();
    // Сведения по каналам
    root[F("delta0")] = cdata.delta0;
    root[F("delta1")] = cdata.delta1;
    root[F("ch0")] = cdata.channel0;
    root[F("ch1")] = cdata.channel1;
    root[F("ch0_start")] = sett.channel0_start;
    root[F("ch1_start")] = sett.channel1_start;
    root[F("imp0")] = data.impulses0;
    root[F("imp1")] = data.impulses1;
    root[F("f0")] = sett.factor0;
    root[F("f1")] = sett.factor1;
    root[F("adc0")] = data.adc0;
    root[F("adc1")] = data.adc1;
    root[F("serial0")] = sett.serial0;
    root[F("serial1")] = sett.serial1;
    root[F("ctype0")] = data.counter_type0;
    root[F("ctype1")] = data.counter_type1;
    root[F("cname0")] = sett.counter0_name;
    root[F("cname1")] = sett.counter1_name;
    root[F("data_type0")] = (uint8_t)data_type_by_name(sett.counter0_name);
    root[F("data_type1")] = (uint8_t)data_type_by_name(sett.counter1_name);

    // Тревоги (#202). Тремя полями на канал, а не битовой маской: их читают и
    // сервер, и шаблоны Home Assistant, где маску пришлось бы разбирать
    // отдельным выражением под каждый бит
    const uint8_t alarm0 = alarm_bits(data.attiny_flags, INPUT0_RED, data.version);
    const uint8_t alarm1 = alarm_bits(data.attiny_flags, INPUT1_BLUE, data.version);

    root[F("alarm_flow0")] = (uint8_t)((alarm0 & ALARM_FLOW) ? 1 : 0);
    root[F("alarm_flow1")] = (uint8_t)((alarm1 & ALARM_FLOW) ? 1 : 0);
    root[F("alarm_leak0")] = (uint8_t)((alarm0 & ALARM_LEAK) ? 1 : 0);
    root[F("alarm_leak1")] = (uint8_t)((alarm1 & ALARM_LEAK) ? 1 : 0);
    root[F("alarm_wet0")] = (uint8_t)((alarm0 & ALARM_WET) ? 1 : 0);
    root[F("alarm_wet1")] = (uint8_t)((alarm1 & ALARM_WET) ? 1 : 0);

    // Остановку потребления считает ЕСП, а не attiny: признак берётся из
    // прироста импульсов, поэтому она работает и со старой attiny
    root[F("alarm_stop0")] = (uint8_t)(consumption_stopped(sett.idle_min0, sett.alarm_stop0) ? 1 : 0);
    root[F("alarm_stop1")] = (uint8_t)(consumption_stopped(sett.idle_min1, sett.alarm_stop1) ? 1 : 0);

    // Пороги: сервер должен видеть, с чем сравнивали
    root[F("af0")] = sett.alarm_flow0;
    root[F("af1")] = sett.alarm_flow1;
    root[F("al0")] = sett.alarm_leak0;
    root[F("al1")] = sett.alarm_leak1;
    root[F("as0")] = sett.alarm_stop0;
    root[F("as1")] = sett.alarm_stop1;

    // Режим "я уехал" (#88): по нему сервер отличает "прорыв трубы" от
    // "был расход, пока вас нет" - порог в обоих случаях один и тот же
    root[F("vac")] = (uint8_t)(sett.vacation ? 1 : 0);

    /*
    Кому доклад о тревоге обязан доехать (#202). Три поля, а не одно число:
    в Home Assistant это три отдельных переключателя, каждому нужно своё
    состояние.
    */
    root[F("ackw")] = (uint8_t)(sett.alarm_confirm & CONFIRM_WATERIUS ? 1 : 0);
    root[F("ackh")] = (uint8_t)(sett.alarm_confirm & CONFIRM_HTTP ? 1 : 0);
    root[F("ackm")] = (uint8_t)(sett.alarm_confirm & CONFIRM_MQTT ? 1 : 0);

    // Сеанс внеплановый, по тревоге, а не по расписанию
    root[F("alarm")] = (uint8_t)(sett.mode == ALARM_MODE ? 1 : 0);

    // Battery & Voltage
    root[F("voltage")] = voltage.average() / 1000.0;
    root[F("voltage_low")] = voltage.low_voltage();
    root[F("voltage_diff")] = (float)voltage.diff() / 1000.0;
    root[F("battery")] = voltage.get_battery_level();

    // Wifi и сеть
    root[F("channel")] = WiFi.channel();
    root[F("wifi_phy_mode")] = wifi_phy_mode_title(WiFi.getPhyMode());
    root[F("wifi_phy_mode_s")] = wifi_phy_mode_title((WiFiPhyMode_t)sett.wifi_phy_mode);
    root[F("wifi_connect_errors")] = sett.wifi_connect_errors;
    root[F("wifi_connect_attempt")] = sett.wifi_connect_attempt;

    uint8_t *bssid = WiFi.BSSID();
    char router_mac[18] = {0};
    sprintf(router_mac, MAC_STR, bssid[0], bssid[1], bssid[2], 0, 0, 0); // последние три октета затираем

    root[F("router_mac")] = String(router_mac);
    root[F("rssi")] = WiFi.RSSI();
    root[F("mac")] = WiFi.macAddress();
    root[F("ip")] = WiFi.localIP().toString();
    root[F("dhcp")] = sett.ip == 0;

    // Общие сведения о приборе
    root[F("version")] = data.version;
    root[F("version_esp")] = FIRMWARE_VERSION;
    root[F("model")] = data.model;
    root[F("esp_id")] = getChipId();
    root[F("flash_id")] = ESP.getFlashChipId();

    root[F("freemem")] = ESP.getFreeHeap();
    root[F("timestamp")] = get_current_time();

    // настройки и события
    root[F("waketime")] = sett.wake_time;
    root[F("period_min_tuned")] = sett.period_min_tuned;
    root[F("period_min")] = sett.wakeup_per_min;

    // Состояние переключателя в Home Assistant (#361)
    root[F("sc")] = sett.send_on_consumption;
    root[F("setuptime")] = sett.setup_time;
    root[F("boot")] = data.service;
    root[F("resets")] = data.resets;
    root[F("mode")] = sett.mode;
    root[F("setup_finished")] = sett.setup_finished_counter;
    root[F("setup_started")] = data.setup_started_counter;
    root[F("ntp_errors")] = sett.ntp_error_counter;
    root[F("mqtt_retain")] = (bool)sett.mqtt_retain;
#if WATERIUS_MODEL == WATERIUS_MODEL_2
    root[F("voltage_cal")] = sett.voltage_cal;
#endif

    // waterius
    root[F("key")] = sett.waterius_key;
    root[F("email")] = sett.waterius_email;

    // Интеграции с системами
    root[F("mqtt")] = is_mqtt(sett);
    root[F("ha")] = is_ha(sett);
    root[F("http")] = is_http(sett);

    // Для юрлиц
    root[F("company")] = sett.company;
    root[F("place")] = sett.place;

    // OTA error
    root[F("ota_error")] = (int)sett.ota_error;

    LOG_INFO(F("JSON: Size: ") << measureJson(json_data));

    // JSON size 1.1.16 929 //no mqtt
    // JSON size 1.1.6 972 //mqtt, max strings
    // JSON size 1.0.1 727 JSON: Mem usage: 1168  //no mqtt
    // JSON size 0.11.4: 722 JSON: Mem usage: 1168
    // JSON size 0.11: 643
    // JSON size 0.10.6: 439
    // JSON size 0.10.3: 355
}
